Revit 2027 API
ParameterTypeId.ViewSolarstudySingledayFrameValue Property
 "Single day frame"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewSolarstudySingledayFrameValue { get; }
Public Shared ReadOnly Property ViewSolarstudySingledayFrameValue As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewSolarstudySingledayFrameValue {
	ForgeTypeId^ get ();
}
static member ViewSolarstudySingledayFrameValue : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace